Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinitionTypeEnum Enumeration
 Defines the different types of classification hierarchies.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum HierarchicDefinitionTypeEnum
Public Enumeration HierarchicDefinitionTypeEnum
Members
Member name | Value | Description
DOT_HIERARCHIC_CUSTOM_TYPE | 0 |  The custom type classification hierarchy.
DOT_HIERARCHIC_LOGICAL_BUILDING_AREA | 1 |  The logical building area classification hierarchy.
DOT_HIERARCHIC_OBJECT_TYPE | 2 |  The object type classification hierarchy.
DOT_HIERARCHIC_TASK_WORK_TYPE | 3 |  The task work type classification hierarchy.
DOT_HIERARCHIC_TASK_SCENARIO | 4 |  The task scenario classification hierarchy.
See Also
Reference
Tekla.Structures.Model Namespace